Config/Catalogs/RoomStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>RoomStatuses</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SortCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomStatusIcon</Name>
					<Type>
						<v8:Type>cfg:EnumRef.RoomStatusesIcons</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CheckInIsForbidden</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PBXCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PBXEndCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Operation</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Operations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegularOperationGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RegularOperationGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OperationIsInProgress</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InspectionIsInProgress</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomIsVacantClear</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NextRoomStatus</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoEmployeeOperation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Color</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IconIndex</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ColorHexString</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>OperationsSchedule</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Operation</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Operations</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TimeFrom</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TimeTo</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>WeekDays</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>TransitionsAllowed</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>RoomStatus</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.RoomStatuses</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/RoomStatusesIcons.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>RoomStatusesIcons</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Vacant</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Reserved</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Occupied</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CheckOut</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TidyingUp</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Waiting</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>None</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OccupiedDirty</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Repair</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Luggage</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Malfunction</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/RoomStatuses/Ext/ManagerModule.bsl
#Region Public

// --------------------------------------------------------------------------------
Procedure FillIconIndex() Export 
	vQuery = New Query;
	vQuery.Text = 
		"SELECT
		|	RoomStatuses.Ref AS Ref
		|FROM
		|	Catalog.RoomStatuses AS RoomStatuses";	
	vQueryResult = vQuery.Execute();	
	vSel = vQueryResult.Select();	
	While vSel.Next() Do
		vObject = vSel.Ref.GetObject();
		vRoomStatusIcon = vObject.RoomStatusIcon;
		If ValueIsFilled(vRoomStatusIcon) Then
			If vRoomStatusIcon = Enums.RoomStatusesIcons.None Then
				vObject.IconIndex = 5;
			ElsIf vRoomStatusIcon = Enums.RoomStatusesIcons.Reserved Then
				vObject.IconIndex = 6;
			ElsIf vRoomStatusIcon = Enums.RoomStatusesIcons.Occupied Then
				vObject.IconIndex = 2;
			ElsIf vRoomStatusIcon = Enums.RoomStatusesIcons.OccupiedDirty Then
				vObject.IconIndex = 7;
			ElsIf vRoomStatusIcon = Enums.RoomStatusesIcons.Waiting Then
				vObject.IconIndex = 1;
			ElsIf vRoomStatusIcon = Enums.RoomStatusesIcons.TidyingUp Then
				vObject.IconIndex = 0;
			ElsIf vRoomStatusIcon = Enums.RoomStatusesIcons.CheckOut Then
				vObject.IconIndex = 3;
			ElsIf vRoomStatusIcon = Enums.RoomStatusesIcons.Vacant Then
				vObject.IconIndex = 4;
			ElsIf vRoomStatusIcon = Enums.RoomStatusesIcons.Repair Then
				vObject.IconIndex = 8;
			ElsIf vRoomStatusIcon = Enums.RoomStatusesIcons.Luggage Then
				vObject.IconIndex = 9;			
			ElsIf vRoomStatusIcon = Enums.RoomStatusesIcons.Malfunction Then
				vObject.IconIndex = 10;
			Else
				vObject.IconIndex = 5;			
			EndIf;
		Else
			vObject.IconIndex = 5;
		EndIf; 

		vObject.Write();
	EndDo;
EndProcedure

// --------------------------------------------------------------------------------
//
// Parameters:
//  pData			 - CatalogRef	 - Ref
//  pReceiverNode	 - ExchangePlanRef	 - The Receiver node
//
Procedure ExchangePlansRecordChanges(pData, pReceiverNode = Undefined) Export
	ExchangePlansProcessing.ExchangePlansRecordChanges(pData, pData.Hotel, pReceiverNode);
EndProcedure // ExchangePlansRecordChanges

#EndRegion
